/*
Настроить проект, вывести в консоль “Hello world!”.
Вывести в консоль системные дату и время.
*/ 

package Seminars.Lesson_1;

import java.time.LocalDateTime;

public class Number_1 {
    public static void main(String[] args) {
        System.out.println("Hello world");
        System.out.println(LocalDateTime.now());
    }
}
